Repository: LinkNacional/payment-gateway-pix-for-givewp
Catalog: languages/payment-gateway-pix-for-givewp-*.po
Languages: pt_br

source: Payment Gateway for Pix on GiveWP
pt_br: Gateway de Pagamento por Pix para GiveWP

source: Loading...
pt_br: Carregando...

source: Pix Key:
pt_br: Chave Pix:

source: Type of Key
pt_br: Tipo de Chave

source: Insert the type of the pix key.
pt_br: Insira o tipo de chave pix

source: Phone
pt_br: Telefone

source: Other
pt_br: Outro

source: Insert the pix key that will be used on the donations.
pt_br: Insira a chave pix a ser utilizada nas doações.

source: Pix Key
pt_br: Chave Pix

source: Recipient Name
pt_br: Nome do Beneficiário

source: Insert the name of the key's recipient.
pt_br: Insira o nome do beneficiário da chave.

source: Recipient City
pt_br: Cidade do Beneficiário

source: Insert the key recipient's city.
pt_br: Insira a cidade do beneficiário da chave

source: Payment Identificator (optional)
pt_br: Identificador de Pagamento (opcional)

source: Insert the payment identificator, not required.
pt_br: Insira o identificador de pagamento, não obrigatório.

source: Enable Debug Mode
pt_br: Habilitar Modo de Depuração

source: Select if logs should be created for debug purposes.
pt_br: Selecione se devem ser criados logs para depuração.

source: Enable
pt_br: Habilitar

source: Disable
pt_br: Desabilitar

source: Collect Billing Details
pt_br: Coletar Detalhes de Cobrança

source: Select if billing details should be added do the donation forms (classic and legacy forms).
pt_br: Selecione se detalhes de cobrança devem ser adicionados aos formulários de doação (para formulários classic ou legacy).

source: Check Last Log
pt_br: Checar Último Log

source: Settings
pt_br: Configurações

source: Choose the type of key you'll use to receive Pix payments
pt_br: Escolha qual tipo de chave irá utilizar para receber o PIX.

source: Enter the Pix key created in your bank that will be used to receive donations.
pt_br: Digite a chave Pix criada no seu Banco que será usada no recebimento das doações.

source: Enter the full name of the Pix beneficiary.
pt_br: Informe o nome completo do favorecido pelo Pix.

source: Enter the name of the city of the Pix key beneficiary.
pt_br: Digite o nome da cidade do favorecido pela chave Pix.

source: Recipient city (optional)
pt_br: Cidade do destinatário (opcional)

source: When this feature is enabled, the plugin will record transaction logs, ideal for error identification.
pt_br: Ao ativar esse recurso, o plugin irá gravar logs das transações ideal para identificação de erros.

source: Select whether billing details should be added to donation forms (classic and legacy forms).
pt_br: Selecione se os detalhes de cobrança devem ser adicionados aos formulários de doação (formulários clássicos e legados).

source: PIX Key Settings
pt_br: Configurações Chave PIX

source: See logs
pt_br: Ver logs

source: Enter the Pix key created in your bank that will be used to receive donations
pt_br: Digite a chave Pix criada no seu Banco que será usada no recebimento das doações

source: Recipient name
pt_br: Nome do beneficiário

source: Recipient city
pt_br: Cidade do beneficiário

source: Saves transactions to the logs.
pt_br: Grava as transações no logs.

source: Enable to show billing details on donation forms
pt_br: Ative para exibir os detalhes de cobrança nos formulários de doação

source: Select the environment in which the payment gateway will operate.
pt_br: Selecione o ambiente em que o gateway de pagamento operará.

source: Enable transaction logging
pt_br: Habilitar registro de transações

source: Displays details of gateway operations in the console.
pt_br: Exibe detalhes das operações dos gateways no console.

source: Chave de identificação da loja virtual
pt_br: Store identification key

source: Store identification credential
pt_br: Credencial de identificação da loja virtual

source: Required to authenticate requests to the BB API.
pt_br: Necessária para autenticar requisições à API do BB.

source: The provided Pix key must be registered and active in Banco do Brasil.
pt_br: A chave Pix informada deve estar cadastrada e ativa no BB.

source: Development for test environment, Production for real donations.
pt_br: Desenvolvimento para ambiente de testes, Produção para ambiente de doações reais.

source: When enabled, all payment gateway operations will be recorded in the logging system.
pt_br: Quando ativado, todas as operações dos gateways de pagamento serão registradas no sistema de logs.

source: Enables detailed messages in the console with information about payment gateway operations.
pt_br: Habilita mensagens detalhadas no console com informações sobre as operações dos gateways de pagamento.

source: The Merchant Key is a secret credential provided by MaxiPago, used to authenticate all requests from your store to the payment API.
pt_br: O Merchant Key é uma credencial secreta fornecida pela MaxiPago, usada para autenticar todas as requisições da sua loja à API de pagamentos.

source: The Merchant ID is the unique identifier provided by MaxiPago that represents your online store on the payment platform.
pt_br: O Merchant ID é o identificador único fornecido pela MaxiPago, que representa sua loja virtual na plataforma de pagamentos.

source: This is the code that identifies your store in the Banco do Brasil system.
pt_br: Este é o código que identifica sua loja no sistema do Banco do Brasil.

source: BB API secret credential. Use with Client ID for secure authentication.
pt_br: Credencial secreta da API BB. Use com o Client ID para autenticação segura.

source: The Developer Key is a security credential provided by Banco do Brasil to authenticate your application with the Payment API.
pt_br: A Developer Key é uma credencial de segurança fornecida pelo Banco do Brasil para autenticar sua aplicação na API de Pagamentos.

source: Enter the license acquired at Link Nacional %sLearn more%s.
pt_br: Digite sua licença adiquirida na link Nacional %sSaiba mais%s.

source: Private key used to authenticate integrations with Banco do Brasil services.
pt_br: Chave privada usada para autenciar a API do Banco do Brasil
